In [1]:
!ls

Untitled.Rmd  Untitled.ipynb  colleges.db

In [2]:
import sqlite3
import pandas as pd
conn = sqlite3.connect("colleges.db")

In [4]:
pd.read_sql_query("select * from sqlite_master where type='table';", conn)

,type,name,tbl_name,rootpage,sql
0,table,College,College,2,"CREATE TABLE College(cName text, state text, e..."
1,table,Student,Student,3,"CREATE TABLE Student(sID int, sName text, GPA ..."
2,table,Apply,Apply,4,"CREATE TABLE Apply(sID int, cName text, major ..."

In [7]:
pd.read_sql_query('select * from College limit 5', conn)

      cName state  enrollment
0  Stanford    CA       15000
1  Berkeley    CA       36000
2       MIT    MA       10000
3   Cornell    NY       21000